lilvinz/chibios/os/common/ports/ARMCMx/devices/STM32F4xx/cmparams.h
/*
    ChibiOS - Copyright (C) 2006..2015 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32F4xx/cmparams.h
 * @brief   ARM Cortex-M4 parameters for the STM32F4xx.
 *
 * @defgroup ARMCMx_STM32F4xx STM32F4xx Specific Parameters
 * @ingroup ARMCMx_SPECIFIC
 * @details This file contains the Cortex-M4 specific parameters for the
 *          STM32F4xx platform.
 * @{
 */

#ifndef _CMPARAMS_H_
#define _CMPARAMS_H_

/**
 * @brief   Cortex core model.
 */
#define CORTEX_MODEL            4

/**
 * @brief   Floating Point unit presence.
 */
#define CORTEX_HAS_FPU          1

/**
 * @brief   Number of bits in priority masks.
 */
#define CORTEX_PRIORITY_BITS    4

/* The following code is not processed when the file is included from an
   asm module.*/
#if !defined(_FROM_ASM_)

/* If the device type is not externally defined, for example from the Makefile,
   then a file named board.h is included. This file must contain a device
   definition compatible with the vendor include file.*/
#if !defined(STM32F405xx) && !defined(STM32F415xx) &&                       \
    !defined(STM32F407xx) && !defined(STM32F417xx) &&                       \
    !defined(STM32F427xx) && !defined(STM32F437xx) &&                       \
    !defined(STM32F429xx) && !defined(STM32F439xx) &&                       \
    !defined(STM32F401xC) && !defined(STM32F401xE) &&                       \
    !defined(STM32F411xE)
#include "board.h"
#endif

/**
 * @brief   Number of interrupt vectors.
 * @note    This number does not include the 16 system vectors.
 */
#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || \
    defined(STM32F417xx)
#define CORTEX_NUM_VECTORS      82
#elif defined(STM32F401xC) || defined(STM32F401xE)
#define CORTEX_NUM_VECTORS      85
#elif defined(STM32F411xE)
#define CORTEX_NUM_VECTORS      86
#elif defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || \
    defined(STM32F439xx)
#define CORTEX_NUM_VECTORS      91
#elif defined(STM32F469xx) || defined(STM32F479xx)
#define CORTEX_NUM_VECTORS      93
#elif defined(STM32F446xx)
#define CORTEX_NUM_VECTORS      97
#elif defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx)
#define CORTEX_NUM_VECTORS      98
#endif

/* Including the device CMSIS header. Note, we are not using the definitions
   from this header because we need this file to be usable also from
   assembler source files. We verify that the info matches instead.*/
#include "stm32f4xx.h"

#if CORTEX_MODEL != __CORTEX_M
#error "CMSIS __CORTEX_M mismatch"
#endif

#if CORTEX_HAS_FPU != __FPU_PRESENT
#error "CMSIS __FPU_PRESENT mismatch"
#endif

#if CORTEX_PRIORITY_BITS != __NVIC_PRIO_BITS
#error "CMSIS __NVIC_PRIO_BITS mismatch"
#endif

#endif /* !defined(_FROM_ASM_) */

#endif /* _CMPARAMS_H_ */

/** @} */
